<?php
return <<<STRING
//四大谋士
array(
    array(
        'info' => array (
            'id' => 20170914,
            'title' => '四大谋士',
            'pindex' => 270,
            'startDay' => 0, //开服第几天开始  从1开始
            'endDay' => 0, //开服第几天结束  从1开始
            'startTime' => '2017-9-14 00:00:00',
            'endTime' => '2017-9-20 23:59:59',  //活动会提前两个小时结束预留发奖励时间
            'type' => 5,//1:普通活动 2:限时活动 3:冲榜活动 4:充值活动 5:谋士 6:巾帼
        ),
        'rwd' => array(
            array(
                'id' => 38,  //门客id
                'need' => 10,  //需要多少的奸臣令
            ),
            array(
                'id' => 39,  //门客id
                'need' => 10,  //需要多少的奸臣令
            ),
            array(
                'id' => 40,  //门客id
                'need' => 10,  //需要多少的奸臣令
            ),
            array(
                'id' => 41,  //门客id
                'need' => 10,  //需要多少的奸臣令
            ),
        ),
        'msg' => '老鼠是老鼠,不是猫!!!!'
    ),
);
STRING;
