<?php
return <<<STRING
//巾帼五虎
array(
    array(
        'info' => array (
            'id' => 20170907,
            'title' => '巾帼五虎',
            'pindex' => 271,
            'startDay' => 0, //开服第几天开始  从1开始
            'endDay' => 0, //开服第几天结束  从1开始
            'startTime' => '2017-9-7 00:00:00',
            'endTime' => '2017-9-13 23:59:59',  //活动会提前两个小时结束预留发奖励时间
            'type' => 6,//1:普通活动 2:限时活动 3:冲榜活动 4:充值活动 5:奸臣 6:巾帼
        ),
        'rwd' => array(
            array(
                'id' => 33,  //门客id
                'need' => 10,  //需要多少的巾帼令
            ),
            array(
                'id' => 34,  //门客id
                'need' => 10,  //需要多少的巾帼令
            ),
            array(
                'id' => 35,  //门客id
                'need' => 10,  //需要多少的巾帼令
            ),
            array(
                'id' => 36,  //门客id
                'need' => 10,  //需要多少的巾帼令
            ),
            array(
                'id' => 37,  //门客id
                'need' => 10,  //需要多少的巾帼令
            ),
        ),
        'msg' => '老鼠是老鼠,不是猫!!!!'
    ),
);
STRING;
