<?php
//热气球移动
return array (
    1 =>
        array (
            'id' => 1,
            'type' => 4,
            'name' => '顺天府',
            'x' => 127,
            'y' => -280,
            'icon' => 101,
        ),
    2 =>
        array (
            'id' => 2,
            'type' => 1,
            'name' => '积分点',
            'x' => 185,
            'y' => -253,
            'icon' => 0,
        ),
    3 =>
        array (
            'id' => 3,
            'type' => 1,
            'name' => '积分点',
            'x' => 207,
            'y' => -200,
            'icon' => 0,
        ),
    4 =>
        array (
            'id' => 4,
            'type' => 1,
            'name' => '积分点',
            'x' => 173,
            'y' => -158,
            'icon' => 0,
        ),
    5 =>
        array (
            'id' => 5,
            'type' => 1,
            'name' => '积分点',
            'x' => 190,
            'y' => -110,
            'icon' => 0,
        ),
    6 =>
        array (
            'id' => 6,
            'type' => 2,
            'name' => '开封府',
            'x' => 163,
            'y' => -71,
            'icon' => 107,
        ),
    7 =>
        array (
            'id' => 7,
            'type' => 1,
            'name' => '积分点',
            'x' => 134,
            'y' => -13,
            'icon' => 0,
        ),
    8 =>
        array (
            'id' => 8,
            'type' => 1,
            'name' => '积分点',
            'x' => 189,
            'y' => 41,
            'icon' => 0,
        ),
    9 =>
        array (
            'id' => 9,
            'type' => 1,
            'name' => '积分点',
            'x' => 190,
            'y' => 102,
            'icon' => 0,
        ),
    10 =>
        array (
            'id' => 10,
            'type' => 1,
            'name' => '积分点',
            'x' => 244,
            'y' => 137,
            'icon' => 0,
        ),
    11 =>
        array (
            'id' => 11,
            'type' => 2,
            'name' => '长沙府',
            'x' => 263,
            'y' => 189,
            'icon' => 111,
        ),
    12 =>
        array (
            'id' => 12,
            'type' => 1,
            'name' => '积分点',
            'x' => 252,
            'y' => 256,
            'icon' => 0,
        ),
    13 =>
        array (
            'id' => 13,
            'type' => 1,
            'name' => '积分点',
            'x' => 282,
            'y' => 327,
            'icon' => 0,
        ),
    14 =>
        array (
            'id' => 14,
            'type' => 1,
            'name' => '积分点',
            'x' => 357,
            'y' => 359,
            'icon' => 0,
        ),
    15 =>
        array (
            'id' => 15,
            'type' => 1,
            'name' => '积分点',
            'x' => 398,
            'y' => 315,
            'icon' => 0,
        ),
    16 =>
        array (
            'id' => 16,
            'type' => 2,
            'name' => '广州府',
            'x' => 413,
            'y' => 266,
            'icon' => 114,
        ),
    17 =>
        array (
            'id' => 17,
            'type' => 1,
            'name' => '积分点',
            'x' => 425,
            'y' => 203,
            'icon' => 0,
        ),
    18 =>
        array (
            'id' => 18,
            'type' => 1,
            'name' => '积分点',
            'x' => 420,
            'y' => 135,
            'icon' => 0,
        ),
    19 =>
        array (
            'id' => 19,
            'type' => 1,
            'name' => '积分点',
            'x' => 462,
            'y' => 91,
            'icon' => 0,
        ),
    20 =>
        array (
            'id' => 20,
            'type' => 1,
            'name' => '积分点',
            'x' => 474,
            'y' => 18,
            'icon' => 0,
        ),
    21 =>
        array (
            'id' => 21,
            'type' => 2,
            'name' => '台湾府',
            'x' => 457,
            'y' => -53,
            'icon' => 112,
        ),
    22 =>
        array (
            'id' => 22,
            'type' => 1,
            'name' => '积分点',
            'x' => 471,
            'y' => -111,
            'icon' => 0,
        ),
    23 =>
        array (
            'id' => 23,
            'type' => 1,
            'name' => '积分点',
            'x' => 449,
            'y' => -167,
            'icon' => 0,
        ),
    24 =>
        array (
            'id' => 24,
            'type' => 1,
            'name' => '积分点',
            'x' => 475,
            'y' => -228,
            'icon' => 0,
        ),
    25 =>
        array (
            'id' => 25,
            'type' => 1,
            'name' => '积分点',
            'x' => 505,
            'y' => -284,
            'icon' => 0,
        ),
    26 =>
        array (
            'id' => 26,
            'type' => 2,
            'name' => '福州府',
            'x' => 502,
            'y' => -349,
            'icon' => 103,
        ),
    27 =>
        array (
            'id' => 27,
            'type' => 1,
            'name' => '积分点',
            'x' => 575,
            'y' => -359,
            'icon' => 0,
        ),
    28 =>
        array (
            'id' => 28,
            'type' => 1,
            'name' => '积分点',
            'x' => 643,
            'y' => -330,
            'icon' => 0,
        ),
    29 =>
        array (
            'id' => 29,
            'type' => 1,
            'name' => '积分点',
            'x' => 668,
            'y' => -267,
            'icon' => 0,
        ),
    30 =>
        array (
            'id' => 30,
            'type' => 1,
            'name' => '积分点',
            'x' => 661,
            'y' => -204,
            'icon' => 0,
        ),
    31 =>
        array (
            'id' => 31,
            'type' => 2,
            'name' => '江宁府',
            'x' => 693,
            'y' => -150,
            'icon' => 104,
        ),
    32 =>
        array (
            'id' => 32,
            'type' => 1,
            'name' => '积分点',
            'x' => 700,
            'y' => -65,
            'icon' => 0,
        ),
    33 =>
        array (
            'id' => 33,
            'type' => 1,
            'name' => '积分点',
            'x' => 715,
            'y' => 6,
            'icon' => 0,
        ),
    34 =>
        array (
            'id' => 34,
            'type' => 1,
            'name' => '积分点',
            'x' => 734,
            'y' => 77,
            'icon' => 0,
        ),
    35 =>
        array (
            'id' => 35,
            'type' => 1,
            'name' => '积分点',
            'x' => 787,
            'y' => 102,
            'icon' => 0,
        ),
    36 =>
        array (
            'id' => 36,
            'type' => 2,
            'name' => '盛京府',
            'x' => 824,
            'y' => 152,
            'icon' => 108,
        ),
    37 =>
        array (
            'id' => 37,
            'type' => 1,
            'name' => '积分点',
            'x' => 829,
            'y' => 206,
            'icon' => 0,
        ),
    38 =>
        array (
            'id' => 38,
            'type' => 1,
            'name' => '积分点',
            'x' => 848,
            'y' => 255,
            'icon' => 0,
        ),
    39 =>
        array (
            'id' => 39,
            'type' => 1,
            'name' => '积分点',
            'x' => 831,
            'y' => 304,
            'icon' => 0,
        ),
    40 =>
        array (
            'id' => 40,
            'type' => 1,
            'name' => '积分点',
            'x' => 841,
            'y' => 370,
            'icon' => 0,
        ),
    41 =>
        array (
            'id' => 41,
            'type' => 3,
            'name' => '顺天府',
            'x' => 127,
            'y' => -280,
            'icon' => 101,
        ),
);