//公告
array(

  array(
     'header' => '《宫廷秘传》安卓计费删档测试结束公告',
     'title' => '《宫廷秘传》安卓计费删档测试结束公告',
     'body' => '亲爱的小主们，

抖音爆款古风剧情手游《宫廷秘传》正式迎来安卓渠道首发，感谢大家一直以来对我们的期待与支持！

开服信息如下：

预下载时间：2019年4月18日10:00

开服时间：2019年4月19日10:00

计费删档测试返利规则：曾在计费删档测试中充值的小主使用先前账号登录游戏即可领取100%的返利，包括VIP经验、充值获得元宝和首充双倍元宝！

版本内容说明：
①  极致剧情，体验大女主人生
游戏最大的亮点便在于边看边玩的极致剧情。在游戏中，每位小主都是古风剧女主角，掌控着自己的命运。通过每一次的抉择，最终走向不同的结局。

② 提升羁绊，书信往来，与皇子们甜蜜互动
提升与各伙伴和知己的羁绊，解锁更多羁绊故事，还可与他们互通书信，日益亲密，谁才会是与你并肩同行，携手人生的伙伴呢？

③ 获取威望，平步青云
小主们在游戏中会随着剧情发展晋升高位，从小小宫女一步步登上青云，更美的华服、更高的俸禄、更大的权力，大女主的人生，由你做主。

④凤冠华服，穿出古风潮流
从宫女起步，小主们的服饰会愈发精致典雅，风格亦是多样。游戏还不定时推出群芳争艳、主题扮装等活动，为爱美的小主们提供展现自我的机会。

⑤ 巡遍各宫、游历各府
书院学习、御膳房做膳、御花园种植花草药材等诸多玩法带小主领略真实的古风生活；考察地方、野外游历带小主感受市井的风土人情。

《宫廷秘传》恭候小主们的到来，愿小主们能在游戏中平步青云！
                                                                                        《宫廷秘传》官方运营团队',
  ),


);
