<?php
/*
 * 活动类说明
 * 1:	3种类资源经营信息
 * 2:	政务处理
 * 3:	门客出战列表 地图关卡BOSS
 * 4:	门客出战列表 世界BOSS - 蒙古军来袭
 * 5:	门客出战列表 世界BOSS - 葛二蛋来袭
 * 6:	门客出战列表 联盟boss
 * 7:	门客出战列表 衙门战 正常出战+出使令
 * 8:	门客出战列表 衙门战 挑战令 挑战+复仇
 * 9:	子嗣招亲列表
 * 10:	子嗣提亲列表
 * 11:	红颜的精力
 * 12:	子嗣席位数量类
 * 13:	战斗2冷却时间
 * 14:	道具合成类
 * 15:	书院桌子数量类
 * 16:	学院学习类
 * 17:	排行膜拜
 * 18:	皇宫请安
 * 19:	牢房
 * 20:	名望
 * 21:	蒙古军来袭
 * 22:	割二蛋来袭
 * 23:	世界BOSS积分兑换
 * 24:	通商
 * 25:	称号
 * 26:	寻访
 * 27:	寻访-赈灾-运势恢复
 * 28:	寻访
 * 29:	寻访--NPC
 * 30:  称号
 * 31:	勤政爱民
 * 32:  新手引导步骤保存
 * 33:  公告
 * 34:  皇宫-个人宣言
 * 35:	每日任务
 * 36:	成就
 * 37:	签到
 * 38:
 * 39:	主线任务
 * 40:	联盟个人信息
 * 41:	联盟个人信息----贡献兑换商店
 * 42:	联盟-跨服帮会战门客列表
 * 43:	联盟-跨服帮会战信息
 * 44:
 * 45:
 * 46:	书院学习记录
 * 47:
 * 48:
 * 49:
 * 50:	酒楼-个人宴会信息
 * 51:	酒楼-兑换商店
 * 52:	酒楼-消息-我的历史宴会
 * 53:	酒楼-消息-仇人信息
 * 54:	酒楼-兑换商店元宝刷新
 * 55:	酒楼--赴会次数
 * 56:
 * 57:
 * 58:
 * 59:
 * 60:	衙门战--个人信息
 * 61:	衙门战--战斗信息
 * 62:	衙门战--防守信息
 * 63:	衙门战--仇人列表
 * 64:	衙门战--挑战CD
 * 65:	神迹福利 -- 还没做
 * 66:	首充福利 -- 还没做
 * 67:	vip福利 --  还没做
 * 68:	月卡/年卡活动 --  还没做
 * 69:	加微信 加QQ
 * 70:  充值-充值档次
 * 71:  vip经验
 * 72:  充值翻倍
 * 73:  获取称号
 * 74:
 * 75:
 * 76:
 * 77:
 * 78:
 * 79:
 * 80:
 * 81:  商城 -- 单品限购
 * 82:  商城 -- 特惠礼包
 * 83:  商城 -- 双十一·单品限购
 * 84:  商城 -- 双十一·特惠礼包
 * 85:  双十一 -- 累计充值
 * 86:
 * 87:
 * 88:
 * 89:
 * 90:   主线的宠幸 第一次 生小孩
 * 91:   势力达到某一值 新增红颜
 * 92:    卷轴升级伪概率
 * 93:    发放邮件
 * 94:    第一次生小孩
 * 95:    第一次科举
 * 96:    通用兑换码
 * 97:    聊天 - 加入黑名单
 *
 *
 * 99:   数据记录
 * 100:   新官上任 - 商城
 * 101:   新官上任 - 兑换
 * 102:   新官上任 - 仓库
 * 103:   新官上任 - 积分
 * 104:   惩戒来福 - 商城
 * 105:   惩戒来福 - 兑换
 * 106:   惩戒来福 - 仓库
 * 107:   惩戒来福 - 积分
 *
 *
 *
 *
 * 110:   狩猎
 * 111:   讨伐
 * 112:   通商-关卡
 * 113:   通商-一键通商开启
 * 114:   国庆活动 - 商城
 * 115:   国庆活动 - 兑换
 * 116:   国庆活动 - 仓库
 * 117:   国庆活动 - 积分
 * 118:   重阳节活动 - 商城
 * 119:   重阳节活动 - 兑换
 * 120:   重阳节活动 - 仓库
 * 121:   重阳节活动 - 积分
 * 122:   重阳节活动 - 累计充值

 *
 *
 *
 * 199:  活动生效列表版本
 * 200:  活动生效列表
 *
 * 201-224: 限时活动
 * 201:  限时奖励-元宝消耗
 * 202:  限时奖励-士兵消耗
 * 203:  限时奖励-银两消耗
 * 204:  限时奖励-强化卷轴消耗
 * 205:  限时奖励-好感度涨幅
 * 206:  限时奖励-势力涨幅
 * 207:  限时奖励-处理政务次数
 * 208:  限时奖励-累计登录天数
 * 209:  限时奖励-衙门分数涨幅
 * 210:  限时奖励-联姻次数
 * 211:  限时奖励-书院学习
 * 212:  限时奖励-经营商产次数
 * 213:  限时奖励-经营农产次数
 * 214:  限时奖励-招募士兵次数
 * 215:  限时奖励-击杀葛尔丹次数
 * 216:  限时奖励-挑战书消耗
 * 217:  限时奖励-惩戒犯人次数
 * 218:  限时奖励-赈灾次数
 * 219:  限时奖励-体力丹消耗
 * 220:  限时奖励-活力丹消耗
 * 221:  限时奖励-魅力值涨幅
 * 222:  限时奖励-赴宴次数
 * 223:  限时奖励-联盟副本伤害
 * 224:  限时奖励-联盟副本击杀（累计击杀僵尸）
 * 225:  限时奖励-酒楼积分涨幅
 *
 *
 * 250:  联盟冲榜
 * 251:  关卡冲榜
 * 252:  势力冲榜
 * 253:  好感冲榜
 * 254:  衙门冲榜
 * 255:  银两冲榜
 * 256:  酒楼冲榜
 * 257:  士兵冲榜
 *
 *
 * 260:  充值活动-每日充值
 * 261:  充值活动-累计充值
 * 262:  充值活动-累天充值
 *
 * 270:  四大奸臣
 * 271:  巾帼五虎
 *
 *
 * 300:  跨服 - 衙门战
 *
 *
 *
 * 400:  兑换码
 *
 * 500:  势力减少记录类
 * 
 * 7010: 新人团购
 */

class   ActBaseModel
{

	//这个类  打包一些 公用的调用方法
	//基于ActModel 的操作方法类
	public $uid;
	public $hid;//活动id
	public $info;//活动数据
	public $outf;//活动输出数据

	//public $_init;//活动数据初始化结构体

	public $comment = "活动名称";//返回信息模块
	public $b_mol;//返回信息模块
	public $b_ctrl;//返回信息控制器
	public $label = "";//倒计时标记


	//更新标记
	public $_update = false;

	/*
	 * 用户ID,活动类型ID,活动ID
	 */
	public function __construct($uid,$hid = 1)
	{
		$this->uid = intval($uid);

		if (empty($this->atype)){
			Master::error('act_model_type_null');
		}
		if (!isset(self::$rightActTypes[$this->atype])) {
            Master::error('act_model_type_error'.$this->atype);
        }

		//基于活动类的存储
		$ActModel = Master::getAct($this->uid, $this->atype);
		if (!empty($ActModel->info)){
			$hd_data = $ActModel->info;
			$hd_data = $hd_data['tjson'];
		}

		if (empty($hd_data) || $hd_data['id'] != $hid){
			$hd_data['data'] = $this->do_init();
		}
		$this->hid = $hid;
		$this->info = $hd_data['data'];

		//构造输出结构体
		$this->make_out();
	}

	/*
	 * 构造输出结构体
	 */
	public function do_init(){
		return $this->_init;
	}

	/*
	 * 构造输出结构体
	 */
	public function make_out(){
		//默认输出直接等于内部存储数据
		$this->outf = $this->info;
	}

	/*
	 * 保存操作
	 */
    public function _save(){
        //基于活动类的存储
        $ActModel = Master::getAct($this->uid,$this->atype);
        $ActModel->setAct($this->atype,array(
            'id'=>$this->hid,
            'data' => $this->info,
        ));
    }

	public function save(){
		//基于活动类的存储
		$this->_save();
        $this->_update = true;
		$this->make_out();
	}

	/*
	 * 获取活动信息
	 */
	public function get_outf(){
		return $this->outf;
	}

	/*
	 * 返回活动信息
	 */
	public function back_data(){
		Master::back_data($this->uid,$this->b_mol,$this->b_ctrl,$this->outf);
	}

	/*
	 * 返回活动更新信息
	 * 如果活动需要分块返回更新信息 则改写这个函数
	 */
	public function back_data_u(){
		//默认调用返回所有信息
		$this->back_data();
	}


	/*
	 * 后端改造配置
	public function get_php_cfg(){


		//???????????????????
		$cache = Common::getCacheBySevId($this->_serverID);



		$key = $this->get_hdcfgKey();
		$hd_cfg = $cache->get($key);
		if (empty($hd_cfg)){
			$hd_cfg = $this->make_php_cfg();
			$cache->set($key,$this->info);
		}
		return $hd_cfg;
	}
	*/


	/*
	 * 后端改造配置 key ::活动公用 不分玩家
	 */
	public function get_hdcfgKey(){
		return 'hdcfgKey_'.$this->atype.'_'.$this->hid;
	}

	/*
	 * 构造后端改造配置
	 */
	public function make_php_cfg(){
		//默认无改造
		return $this->hd_cfg;
	}

    /**
     * 设置今日红点时间
     */
    public function setDayNews()
    {
        if (in_array($this->atype, self::$_dayNewsTypes)) {
            $this->info['_day_news'] = date("Ymd");
            $this->save();
        }
    }

    /**
     * 红点处理
     * @return int 0:有红点，1:没有红点
     */
    public function get_news()
    {
        if (in_array($this->atype, self::$_dayNewsTypes)) {
            //第一次红点
            if (empty($this->info['_day_news']) || $this->info['_day_news'] != date("Ymd")) {
                return 1;
            }
        }
        return 0;
    }

	/*
	 * crontab - distroy()
	 * 后台脚本 即时写入
	 */
	public function ht_destroy(){
		$ActModel = Master::getAct($this->uid, $this->atype);
		$ActModel->destroy();
	}

    /**
     * 一次性红点提示类型，每天提示一次
     * @var array
     */
	protected static $_dayNewsTypes = array(
	    280, 282, 342
    );
	public static $rightActTypes = array(
        1 => '3种类资源经营信息',
        2 => '政务处理',
        3 => '门客出战列表地图关卡BOSS',
        4 => '门客出战列表世界BOSS-蒙古军来袭',
        5 => '门客出战列表世界BOSS-葛二蛋来袭',
        6 => '门客出战列表联盟boss',
        7 => '门客出战列表衙门战正常出战+出使令',
        8 => '门客出战列表衙门战挑战令挑战+复仇',
        9 => '子嗣招亲列表',
        10 => '子嗣提亲列表',
        11 => '红颜的精力',
        12 => '子嗣席位数量类',
        13 => '战斗2冷却时间',
        14 => '道具合成类',
        15 => '书院桌子数量类',
        16 => '学院学习类',
        17 => '排行膜拜',
        18 => '皇宫请安',
        19 => '牢房',
        20 => '名望',
        21 => '蒙古军来袭',
        22 => '割二蛋来袭',
        23 => '世界BOSS积分兑换',
        24 => '跑马灯--系统/客服',
        25 => '称号',
        26 => '寻访',
        27 => '寻访-赈灾-运势恢复',
        28 => '寻访',
        29 => '寻访--NPC',
        30 => '称号',
        31 => '勤政爱民',
        32 => '新手引导步骤保存',
        33 => '公告',
        34 => '皇宫-个人宣言',
        35 => '每日任务',
        36 => '成就',
        37 => '签到',
        38 => '公用兑换码',
        39 => '主线任务',
        40 => '联盟个人信息',
        41 => '联盟个人信息-贡献兑换商店',
        42 => '联盟-跨服帮会战门客列表',
		43 => '联盟-红包券信息',
		44 => '联盟-我的红包信息',
		45 => '联盟-我的已领取红包信息',
        46 => '书院学习记录',
		47 => '红颜-转世',
        48 => '玩家记录特殊信息',
        49 => '帮会红包-膜拜',
        50 => '酒楼-个人宴会信息',
        51 => '酒楼-兑换商店',
        52 => '酒楼-消息-我的历史宴会',
        53 => '酒楼-消息-仇人信息',
        54 => '酒楼-兑换商店元宝刷新',
        55 => '宴会-赴会次数',
		56 => '行为记录',
        58 => '翰林院-个人信息',
		59 => '封号封设备',
        60 => '衙门战--个人信息',
        61 => '衙门战--战斗信息',
        62 => '衙门战--防守信息',
        63 => '衙门战--仇人列表',
        64 => '衙门战--衙门日志列表挑战记录',
        65 => '神迹福利--还没做',
        66 => '首充福利--还没做',
        67 => 'vip福利--还没做',
        68 => '月卡/年卡活动--还没做',
        69 => '加微信加QQ',
        70 => '充值-充值档次',
        71 => 'vip经验',
        72 => '充值翻倍',
        73 => '获取称号',
        74 => '用户场景',
		75 => '国子监-位子',
		76 => '国子监-打工',
		77 => '国子监-子嗣人气',
		78 => '国子监-已打工列表',
		79 => '国子监-送礼',
		80 => '商城-单品限购(基础配置)',
        81 => '商城-单品限购',
        82 => '商城-特惠礼包',
        83 => '双十一单品限购',
        84 => '双十一特惠礼包',
        85 => '双十一-累计充值',
        86 => '双12-获得积分',
        87 => '双旦-寻宝大冒险 - 任务每日重置',
        88 => '用户回归奖励',
        89 => '挖宝 - 任务每日重置',
        90 => '主线的宠幸第一次生小孩',
        91 => '势力达到某一值新增红颜',
        92 => '卷轴升级伪概率',
        93 => '发放邮件',
        94 => '第一次生小孩',
        95 => '第一次科举',
        96 => '通用兑换码',
        97 => '聊天-加入黑名单',
        98 => '聊天-禁言内容',
        99 => '数据记录',
        100 => '新官上任-商城',
        101 => '新官上任-兑换',
        102 => '新官上任-仓库',
        103 => '新官上任-积分',
        104 => '惩戒来福-商城',
        105 => '惩戒来福-兑换',
        106 => '惩戒来福-仓库',
        107 => '惩戒来福-积分',
        110 => '狩猎',
        111 => '讨伐',
        112 => '通商-关卡',
        113 => '通商-一键通商开启',
        114 => '国庆活动-商城',
        115 => '国庆活动-兑换',
        116 => '国庆活动-仓库',
        117 => '国庆活动-积分',
        118 => '重阳节活动-商城',
        119 => '重阳节活动-兑换',
        120 => '重阳节活动-仓库',
        121 => '重阳节活动-积分',
        122 => '重阳节活动-累计充值',
		123 => '感恩节活动-商城',
		124 => '感恩节活动-兑换',
		125 => '感恩节活动-仓库',
		126 => '感恩节活动-积分',
		127 => '感恩节活动-累计充值',
		128 => '发配-桌子个数',
		129 => '发配-发配列表',
        130 => '好友系统',
        131 => '申请好友列表',
        132 => '申请好友列表限制',
        133 => '亲家列表',
        134 => '亲家好感度',
        135 => '私聊列表',
		136 => '腊八节活动-商城',
		137 => '腊八节活动-兑换',
		138 => '腊八节活动-仓库',
		139 => '腊八节活动-积分',
		140 => '腊八节活动-累天充值',
		141 => '新年活动-仓库',
		142 => '新年活动-兑换',
		143 => '新年活动-商城',
		144 => '新年活动-积分',
		145 => '静心苑-桌子个数',
		146 => '静心苑-发配列表',
		147 => '太平天国-次数',
		148 => '太平天国-商城',
		149 => '太平天国-个人敌情',
        150 => '玩家信息隐私查看开关',
        151 => '情人节活动-获赠记录',
        152 => '百服开服充值不断,福利礼包不停',
		153 => '植树节活动-商城',
		154 => '植树节活动-兑换',
		155 => '植树节活动-仓库',
		156 => '植树节活动-积分',
		157 => '植树节活动-累天充值',
		158 => '太平天国-已打门客列表',
        160 => '红颜位分',
		161 => '愚人节活动-商城',
		162 => '愚人节活动-兑换',
		163 => '愚人节活动-仓库',
		164 => '愚人节活动-积分',
		165 => '愚人节活动-累天充值',
		166 => '皮肤系统-佳人皮肤',
		167 => '皮肤系统-门客皮肤',
		168 => '皮肤系统-佳人穿戴',
		169 => '皮肤系统-门客穿戴',
		170 => '酒楼-个人宴会信息',
		171 => '酒楼-兑换商店',
		172 => '酒楼-已使用门客信息',
		181 => '坐骑系统-车位个数',
		182 => '坐骑系统-车辆信息列表',
		183 => '坐骑系统-车辆零件列表',
		184 => '坐骑系统-开车信息',
		185 => '坐骑系统-第一次获得车',
        199 => '活动生效列表版本',
        200 => '活动生效列表',
        201 => '限时奖励-元宝消耗',
        202 => '限时奖励-士兵消耗',
        203 => '限时奖励-银两消耗',
        204 => '限时奖励-强化卷轴消耗',
        205 => '限时奖励-好感度涨幅',
        206 => '限时奖励-势力涨幅',
        207 => '限时奖励-处理政务次数',
        208 => '限时奖励-累计登录天数',
        209 => '限时奖励-衙门分数涨幅',
        210 => '限时奖励-联姻次数',
        211 => '限时奖励-书院学习',
        212 => '限时奖励-经营商产次数',
        213 => '限时奖励-经营农产次数',
        214 => '限时奖励-招募士兵次数',
        215 => '限时奖励-击杀葛尔丹次数',
        216 => '限时奖励-挑战书消耗',
        217 => '限时奖励-惩戒犯人次数',
        218 => '限时奖励-赈灾次数',
        219 => '限时奖励-体力丹消耗',
        220 => '限时奖励-活力丹消耗',
        221 => '限时奖励-魅力值涨幅',
        222 => '限时奖励-赴宴次数',
        223 => '限时奖励-联盟副本伤害',
        224 => '限时奖励-联盟副本击杀（累计击杀僵尸）',
        225 => '限时奖励-酒楼积分涨幅',
        226 => '限时奖励-限时粮食消耗',
        227 => '限时奖励-精力丹消耗',
        250 => '联盟冲榜',
        251 => '关卡冲榜',
        252 => '势力冲榜',
        253 => '好感冲榜',
        254 => '衙门冲榜',
        255 => '银两冲榜',
        256 => '酒楼冲榜',
        257 => '士兵冲榜',
        258 => '魅力冲榜',
        259 => '粮食冲榜',
        260 => '充值活动-每日充值',
        261 => '充值活动-累计充值',
        262 => '充值活动-累天充值',
		263 => '充值活动-商会充值(都市版)',
        270 => '四大奸臣',
        271 => '巾帼五虎',
        272 => '巾帼女将',
        280 => '新官上任',
        281 => '重阳节活动',
        282 => '惩戒来福',
        283 => '国庆活动',
		284 => '感恩节活动',
        285 => '双十一活动',
		286 => '腊八节活动',
        287 => '七天签到活动',
		288 => '植树节活动',
		289 => '愚人节活动',
        290 => '转盘双12',
        291 => '双旦-砸蛋活动',
        292 => '双旦-收集兑换',
        293 => '寻宝大冒险',
        294 => '招财进宝',
		295 => '发红包',
        296 => '挖宝活动',
        297 => '情人节活动',
		298 => '新年活动',
		299 => '线下活动-限时元宝消耗',
		300 => '跨服-衙门战',
        301 => '衙门战-战斗信息',
        302 => '跨服衙门战出战',
        303 => '跨服衙门战复仇',
        304 => '跨服衙门-防守信息',
        305 => '跨服衙门-仇人信息',
        306 => '跨服衙门-预选赛门票',
        307 => '跨服衙门-领取全服奖励',
        308 => '跨服衙门日志列表挑战记录',
        310 => '联盟势力涨幅冲榜排行',
		311 => '子嗣势力涨幅冲榜排行',
        313 => '跨服势力冲榜',
        314 => '跨服好感冲榜',
        315 => '宫殿宫斗冲榜',
        316 => '连续首冲活动',
        317 => '抽卡活动',
        318 => '卡牌剧情活动',
        319 => '四海奇珍剧情活动',
        320 => '四海奇珍剧情活动',
        330 => '元宵节活动',
        400 => '兑换码',
        500 => '势力减少记录类',
        
        700 => '七日庆典',
        
        701 => '0元购',
        
        702 => '钱庄',

        703 => '赴约',
        704 => '赴约-回忆录',
        705 => '赴约-战斗记录',
        706 => '赴约-兑换商城',
        
        707 => '行商',
        708 => '行商-背包',
        709 => '行商-购买信息',
        710 => '行商-开始次数',
        711 => '行商-开始信息',

        712 => '办差-基本信息',
        713 => '办差-剧情信息',
        714 => '办差-领取奖励',
        715 => '办差-购买次数',
        716 => '办差-次数及恢复时间',

        720 => '弹劾-弹劾次数',
        721 => '弹劾-弹劾外围信息',
        722 => '弹劾-弹劾信息',

        725 => '伙伴拜访-次数',
        726 => '伙伴拜访-单局游戏',

        730 => '伙伴邀约',
        731 => '伙伴邀约-次数',
        732 => '伙伴邀约-饮食游戏',
        733 => '伙伴邀约-图鉴',
        734 => '伙伴邀约-收集奖励',
        735 => '伙伴邀约-钓鱼',
        736 => '伙伴邀约-购买次数',
        737 => '伙伴邀约-成就',
        738 => '伙伴邀约-第一次进入给鱼饵',

        740 => '郊游-关卡信息',
        741 => '郊游-每天守护次数',
        742 => '郊游-每周守护次数',
        743 => '郊游-元宝购买次数',
        744 => '郊游-战斗',
        745 => '郊游-守护列表',

        750 => '弹出礼包',
        751 => '弹出礼包最大次数',

        755 => '华服等级领取奖励',
        756 => '锦衣裁剪',
        757 => '心忆',
        758 => '心忆-刷新次数',
        759 => '装备特效',
        
        760 => '公会活跃度',
        761 => '公会每日任务',

        762 => '卡牌羁绊',
        763 => '战斗编队',
        764 => '战斗中上阵卡牌',
        765 => '小战斗',

        766 => '徒弟游历每天推荐方向',

        767 => '公会宴会-提交资源',
        768 => '公会宴会-更换乐师',
        769 => '公会宴会-抢红包',
        770 => '公会宴会-挂机奖励',
        771 => '公会宴会-花签',
        772 => '公会宴会-领取游戏奖励',

        1000 => '角色删除',
        1001 => '角色重置',

        2000 => '伙伴培养道具信息',
        2001 => '伙伴信物',
        2002 => '伙伴信物羁绊',
        2003 => '伙伴羁绊解锁判断',
        2004 => '羁绊解锁领取奖励',
        2005 => '伙伴商城购买道具',

        6000 => '门客特殊关卡信息保存',
        6001 => '门客红颜的羁绊值和声望',
        6002 => '首次招到门客寻访',
        6003 => '差事委派',
        6004 => '邮件',
        6005 => '羁绊剧情等级',
        6006 => '卡牌羁绊',
        6010 => '活动boss',
        6011 => '活动boss',
        6012 => '福利签到',
        6014 => '吉利话',
        6015 => '抢汤圆',
        6100 => '御膳房信息',
        6101 => '御膳房煮饭信息',
        6102 => '御膳房一键设置',
        6103 => '御膳房菜单图鉴',
        6104 => '御膳房等级',
        6105 => '书院等级',
        6106 => '科举',
        6107 => '科举',
        6110 => '珍宝馆',
        6111 => '珍宝馆整理',
        6120 => '存储门客选择',
        6121 => '天天秒杀',
        6122 => '天天秒杀',
        6123 => '盛装出席',

        6130 => '玩家额外属性',
        6131 => '出游假期',
        6132 => '历练席位',
        6133 => '徒弟历练-历练列表',
        6134 => '徒弟信件',
        6135 => '珍宝阁积分冲榜',
        6136 => '皇子应援活动',
        6137 => '伙伴语音包活动',
        6138 => '伙伴知己-闲谈',
        6139 => '限时奖励-单次充值档次',

		6140 => '主角换装',
        6141 => '主角换装',
        6142 => '盛装出席',
        6143 => '伙伴换装',
        6144 => '伙伴空间背景',
        6145 => '伙伴表情包',
        6150 => '主角头像',
        6151 => '主角头像',
        6152 => '活动兑换',
        6153 => '分享给奖励',
        6154 => '祈福给资源',

        6160 => '皇子应援活动 - 商城',
        6161 => '皇子应援活动 - 兑换',
        6162 => '皇子应援活动 - 仓库',
        6163 => '皇子应援活动 - 积分',
        6164 => '皇子应援活动 - 贡献',
        6165 => '皇子应援活动-累天充值',
        6166 => '伙伴羁绊冲榜',
        6167 => '伙伴资质冲榜',
        6168 => '天天充值',
        6169 => '命盘活动',

        6170 => '限时珍宝阁累计整理关卡次数',
        6171 => '限时奖励-祈福次数',
        6172 => '限时奖励-精力丹消耗',
        6173 => '限时奖励-知己出游次数',
        6174 => '限时奖励-问候知己次数',
        6175 => '限时奖励-郊祀献礼次数',
        6176 => '限时奖励-皇子应援次数',
        6177 => '限时奖励-出城寻访次数',
        6178 => '限时奖励-徒弟历练次数',
        6179 => '限时奖励-御膳房烹饪次数',

        6180 => '直冲礼包活动',
        6181 => '皇子累充解锁',
        6182 => '身份大礼活动',
        6183 => '堆雪人活动',
        6184 => '连续充值活动',
        6185 => '直充记录',
        6186 => '限时奖励-冬至累计登录天数',
        6187 => '国力庆典',
        6188 => '充值翻牌',
        6189 => '点灯笼-春节活动',

        6190 => '御花园',
        6191 => '御花园',
        6192 => '御花园',
        6193 => '御花园',
        6194 => '御花园',

        6200 => '国力庆典-每日总排行',
        6201 => '国力庆典-每日元宝消耗排行',
        6202 => '国力庆典-每日阅历消耗排行',
        6203 => '国力庆典-每日银两消耗排行',
        6204 => '国力庆典-每日名声消耗排行',
        6205 => '国力庆典-每日上交珍宝次数排行',
        6206 => '国力庆典-每日办理日常次数排行',
        6207 => '国力庆典-每日出城寻访排行',
        6208 => '国力庆典-每日联姻次数排行',

        6210 => '许愿树',
        6211 => '二十四节气',
        6212 => '限时-御花园偷取晨露',
        6213 => '限时-御花园种植',
        6214 => '福星锦鲤活动',
        6215 => '偷取晨露次数冲榜',
        6216 => '晨露消耗冲榜',
        6217 => '知己技能经验涨幅冲榜',
        6218 => '徒弟势力冲榜',
        6219 => '领袖气质',
        6220 => '女生节活动',
        6221 => '植树节',
        6222 => '清明节',
        6223 => '清明节-拼图',
        6224 => '舞狮大会',
        6225 => '新累天充值',
        6226 => '单笔连充活动',
        6227 => '幸运转盘',
        6228 => '读书节活动',
        6229 => '劳动节活动',
        6230 => '端午节活动',
        6231 => '抢糕点活动',
        6232 => '热气球活动',
        8002 => '凰之历练活动',
        6233 => '四大藩王',
        6234 => '荷诞日',
        6240 => '跨服兑换商城',
        6241 => '七夕',
        6242 => '天赐抽卡',

        7001 => 'kv展示',
        7010 => '新人团购',

        6500 => '三十天签到活动',
        8003 => '许愿池',
        8004 => '购物狂欢',
        8005 => '圣诞节活动',
        8006 => '厨艺大赛',
        8007 => '珍绣坊',
        8008 => '新春活动',
        8009 => '情人节活动',
        
        8011 => '贵人令',
        8012 => '金叶子',
        8016 => '新贵人令',
        8018 => '三消',

        8020 => '公会邀请列表',
        
        8022 => '豆腐女孩活动',
        8023 => '好友送礼',
        8026 => '海滩夺宝',
        8029 => '打月亮',


        8500 => '记录卡牌特效开关',

        9000 => '上一次聊天时间',
    );
}
