<?php
/*
 * 后台配置
 */
return array(
	'len' => 2,
	'names' => array(
		0 => array(
			"양", "화", "백", "장", "운", "소", "물", "묘", "봉", "화", "방","류", "잠", "니", "악", "요", "미", "수", "베", "람", "공", "울", "오","잔","냉","신","죽","홍","하","령","하","뮤","선","구","혜","병","예","거","우","목","비","이","추","행","귀","교","신","기","려","용","무","여","염","애","어","고","이","엽","구","조","전","손","주","오","왕","정","무용","오양","동방","남궁","서문","강","상궁","종리","태사","사마","제갈","독구","다목","위치","군대","공손","장손","궈박","우문","하란","황포","나란","령후","동과","하후","사도","동","요가","부차","교가","마","마가","완암","예율","각락","동악"
		),
		1 => array(
			"혜진","혜리","희아","희예","희윤","희은지영","지원","지희","지연","진유","진희","진영","정윤","정원","정은","채미","진아","정예","지민","수민","정민","정빈","지유","지우","지호","지현","지은","지효","지후","지윤","정우","정현","주현","주영","준우","지아","정희","정혜","채영","채연","채현","지안","주아","채윤","지율","지수","채빈","지연","정미","정인","지선","재민","지혜","재인","정아","채민","정음","주미","주향","채원","채은","지유","초희","초아","채아","재은","정임","주희","주원","주향","채율","지인","재이","준서소율","선율","슬아","슬예","소현","세영","세현","세은","세진","순우소온","선미","서아","선율","세미","소미","소민","소은","소이","시연","시아","시하","세아","순수","수아","수빈","수지","수진","수정","서원","승미","서현","선정","승빈","서하","서이","수이","수혜","시유","시영","성원","선우","선현","소율","서우","서인","승민","승희","승혜","서진","시윤","서율","서영","선영","성희","서빈","소영","수미","수민","수현","시우","시원","시호","시현","시은","시효","수영","수희","수연","선화","선예","선유","선희","소윤","소희","소연","서윤","서유","서희","서연","혜영","하리","하희","현희","현영","화영","희영","하영","혜란","하림","효리","혜련","혜라","혜린","하선","현지","현선","혜지","혜원","하나","하니","하라","하연","하율","하은","향기","현아","혜은혜주","화정","하린","혜나","현수","혜진","호정","효선","효진","희숙","현숙","희지","화선","현서","영인","유영","현승","현정","현주","현진","희선","희수","희주","희정","희진","희승","혜수","혜정","인혜","연아","영원","영은","유라","인예","유연","유화","영란","유란","윤예","윤혜","윤희","은희","우영","율희","아진","아유","유이","연희","인우","은아","아리","영운","영아","예희","연우","영우","아랑","아인","예솔","예슬","온유","유은","윤하","은유","인아","아영","예린","아윤","유희","예은","영주","유리","영진","이랑","연선","연수","연승","윤주","익선","애리","은주","은선","우주","예원","유주","은재","이수","윤나","연지","아정","유정","유진","연재","예희","여정","우정","윤정","영선","은정","예진","예나","은채","영서","영선","유나","윤아","은나","예주","연주","영지","안나","아란","아린","아지","윤지","윤서","윤채","영채","연서","연채","연정","예서","예지","윤수","은서","은수","리연","리인","리현","리원","리향루나","루아","라윤","라은","라일","라희","리아","리우","리영","리화","리혜","린아","리나","리안","단영","단혜","도이","도희","도혜","도하","도옥","도원","다은","도윤","동주","도아","도화","다영","다온","다원","다혜","다윤","다연","다현","다인","다희","도영","도현","도연","다빈","도은","단아","나래","나율","나은","나리","누리","나경","나연","나희","나영","나원","나혜","나현"
		),
	),
);