<?php
//成就总览表
return array (
  25001 => 
  array (
    'id' => 25001,
    'title' => '收集指定次数',
  ),
  25002 => 
  array (
    'id' => 25002,
    'title' => '收集指定次数',
  ),
  25003 => 
  array (
    'id' => 25003,
    'title' => '收集指定次数',
  ),
  25004 => 
  array (
    'id' => 25004,
    'title' => '收集指定次数',
  ),
  25005 => 
  array (
    'id' => 25005,
    'title' => '收集指定次数',
  ),
  25100 => 
  array (
    'id' => 25100,
    'title' => '收集指定次数',
  ),
  25101 => 
  array (
    'id' => 25101,
    'title' => '收集指定次数',
  ),
  25102 => 
  array (
    'id' => 25102,
    'title' => '收集指定次数',
  ),
  25103 => 
  array (
    'id' => 25103,
    'title' => '收集指定次数',
  ),
  25104 => 
  array (
    'id' => 25104,
    'title' => '收集指定次数',
  ),
  25105 => 
  array (
    'id' => 25105,
    'title' => '收集指定次数',
  ),
  25106 => 
  array (
    'id' => 25106,
    'title' => '收集指定次数',
  ),
  25107 => 
  array (
    'id' => 25107,
    'title' => '收集指定次数',
  ),
  25108 => 
  array (
    'id' => 25108,
    'title' => '收集指定次数',
  ),
  25109 => 
  array (
    'id' => 25109,
    'title' => '收集指定次数',
  ),
  25110 => 
  array (
    'id' => 25110,
    'title' => '收集指定次数',
  ),
  25111 => 
  array (
    'id' => 25111,
    'title' => '收集指定次数',
  ),
  25112 => 
  array (
    'id' => 25112,
    'title' => '收集指定次数',
  ),
  25113 => 
  array (
    'id' => 25113,
    'title' => '收集指定次数',
  ),
  25114 => 
  array (
    'id' => 25114,
    'title' => '收集指定次数',
  ),
  25115 => 
  array (
    'id' => 25115,
    'title' => '收集指定次数',
  ),
  25116 => 
  array (
    'id' => 25116,
    'title' => '收集指定次数',
  ),
  25200 => 
  array (
    'id' => 25200,
    'title' => '收集指定次数',
  ),
  25201 => 
  array (
    'id' => 25201,
    'title' => '收集指定次数',
  ),
  25202 => 
  array (
    'id' => 25202,
    'title' => '收集指定次数',
  ),
  25203 => 
  array (
    'id' => 25203,
    'title' => '收集指定次数',
  ),
  25204 => 
  array (
    'id' => 25204,
    'title' => '收集指定次数',
  ),
  25205 => 
  array (
    'id' => 25205,
    'title' => '收集指定次数',
  ),
  25206 => 
  array (
    'id' => 25206,
    'title' => '收集指定次数',
  ),
  25207 => 
  array (
    'id' => 25207,
    'title' => '收集指定次数',
  ),
  25208 => 
  array (
    'id' => 25208,
    'title' => '收集指定次数',
  ),
  25209 => 
  array (
    'id' => 25209,
    'title' => '收集指定次数',
  ),
  25210 => 
  array (
    'id' => 25210,
    'title' => '收集指定次数',
  ),
  25211 => 
  array (
    'id' => 25211,
    'title' => '收集指定次数',
  ),
  25212 => 
  array (
    'id' => 25212,
    'title' => '收集指定次数',
  ),
  25213 => 
  array (
    'id' => 25213,
    'title' => '收集指定次数',
  ),
  25214 => 
  array (
    'id' => 25214,
    'title' => '收集指定次数',
  ),
  25215 => 
  array (
    'id' => 25215,
    'title' => '收集指定次数',
  ),
  25216 => 
  array (
    'id' => 25216,
    'title' => '收集指定次数',
  ),
  25217 => 
  array (
    'id' => 25217,
    'title' => '收集指定次数',
  ),
  25218 => 
  array (
    'id' => 25218,
    'title' => '收集指定次数',
  ),
  25219 => 
  array (
    'id' => 25219,
    'title' => '收集指定次数',
  ),
  25220 => 
  array (
    'id' => 25220,
    'title' => '收集指定次数',
  ),
  25221 => 
  array (
    'id' => 25221,
    'title' => '收集指定次数',
  ),
  25300 => 
  array (
    'id' => 25300,
    'title' => '收集指定次数',
  ),
  25301 => 
  array (
    'id' => 25301,
    'title' => '收集指定次数',
  ),
  25302 => 
  array (
    'id' => 25302,
    'title' => '收集指定次数',
  ),
  25303 => 
  array (
    'id' => 25303,
    'title' => '收集指定次数',
  ),
  25304 => 
  array (
    'id' => 25304,
    'title' => '收集指定次数',
  ),
  25305 => 
  array (
    'id' => 25305,
    'title' => '收集指定次数',
  ),
  25306 => 
  array (
    'id' => 25306,
    'title' => '收集指定次数',
  ),
  25307 => 
  array (
    'id' => 25307,
    'title' => '收集指定次数',
  ),
  25308 => 
  array (
    'id' => 25308,
    'title' => '收集指定次数',
  ),
  25309 => 
  array (
    'id' => 25309,
    'title' => '收集指定次数',
  ),
  25310 => 
  array (
    'id' => 25310,
    'title' => '收集指定次数',
  ),
  25311 => 
  array (
    'id' => 25311,
    'title' => '收集指定次数',
  ),
);