<?php
//酒楼-宴会信息
return array (
  1 => 
  array (
    'id' => 1,
    'type' => 4,
    'name' => '顺天府',
    'x' => 127,
    'y' => -280,
    'icon' => 101,
  ),
  2 => 
  array (
    'id' => 2,
    'type' => 1,
    'name' => '积分点',
    'x' => 60,
    'y' => 387,
    'icon' => 0,
  ),
  3 => 
  array (
    'id' => 3,
    'type' => 1,
    'name' => '积分点',
    'x' => 40,
    'y' => 323,
    'icon' => 0,
  ),
  4 => 
  array (
    'id' => 4,
    'type' => 1,
    'name' => '积分点',
    'x' => 65,
    'y' => 265,
    'icon' => 0,
  ),
  5 => 
  array (
    'id' => 5,
    'type' => 1,
    'name' => '积分点',
    'x' => 109,
    'y' => 211,
    'icon' => 0,
  ),
  6 => 
  array (
    'id' => 6,
    'type' => 2,
    'name' => '开封府',
    'x' => 174,
    'y' => 170,
    'icon' => 107,
  ),
  7 => 
  array (
    'id' => 7,
    'type' => 1,
    'name' => '积分点',
    'x' => 98,
    'y' => 132,
    'icon' => 0,
  ),
  8 => 
  array (
    'id' => 8,
    'type' => 1,
    'name' => '积分点',
    'x' => 61,
    'y' => 84,
    'icon' => 0,
  ),
  9 => 
  array (
    'id' => 9,
    'type' => 1,
    'name' => '积分点',
    'x' => 58,
    'y' => 23,
    'icon' => 0,
  ),
  10 => 
  array (
    'id' => 10,
    'type' => 1,
    'name' => '积分点',
    'x' => 85,
    'y' => -27,
    'icon' => 0,
  ),
  11 => 
  array (
    'id' => 11,
    'type' => 2,
    'name' => '长沙府',
    'x' => 139,
    'y' => -61,
    'icon' => 111,
  ),
  12 => 
  array (
    'id' => 12,
    'type' => 1,
    'name' => '积分点',
    'x' => 193,
    'y' => -88,
    'icon' => 0,
  ),
  13 => 
  array (
    'id' => 13,
    'type' => 1,
    'name' => '积分点',
    'x' => 230,
    'y' => -125,
    'icon' => 0,
  ),
  14 => 
  array (
    'id' => 14,
    'type' => 1,
    'name' => '积分点',
    'x' => 221,
    'y' => -169,
    'icon' => 0,
  ),
  15 => 
  array (
    'id' => 15,
    'type' => 1,
    'name' => '积分点',
    'x' => 269,
    'y' => -196,
    'icon' => 0,
  ),
  16 => 
  array (
    'id' => 16,
    'type' => 2,
    'name' => '广州府',
    'x' => 341,
    'y' => -216,
    'icon' => 114,
  ),
  17 => 
  array (
    'id' => 17,
    'type' => 1,
    'name' => '积分点',
    'x' => 406,
    'y' => -238,
    'icon' => 0,
  ),
  18 => 
  array (
    'id' => 18,
    'type' => 1,
    'name' => '积分点',
    'x' => 456,
    'y' => -249,
    'icon' => 0,
  ),
  19 => 
  array (
    'id' => 19,
    'type' => 1,
    'name' => '积分点',
    'x' => 528,
    'y' => -244,
    'icon' => 0,
  ),
  20 => 
  array (
    'id' => 20,
    'type' => 1,
    'name' => '积分点',
    'x' => 585,
    'y' => -223,
    'icon' => 0,
  ),
  21 => 
  array (
    'id' => 21,
    'type' => 2,
    'name' => '台湾府',
    'x' => 654,
    'y' => -195,
    'icon' => 112,
  ),
  22 => 
  array (
    'id' => 22,
    'type' => 1,
    'name' => '积分点',
    'x' => 649,
    'y' => -150,
    'icon' => 0,
  ),
  23 => 
  array (
    'id' => 23,
    'type' => 1,
    'name' => '积分点',
    'x' => 612,
    'y' => -112,
    'icon' => 0,
  ),
  24 => 
  array (
    'id' => 24,
    'type' => 1,
    'name' => '积分点',
    'x' => 561,
    'y' => -126,
    'icon' => 0,
  ),
  25 => 
  array (
    'id' => 25,
    'type' => 1,
    'name' => '积分点',
    'x' => 524,
    'y' => -87,
    'icon' => 0,
  ),
  26 => 
  array (
    'id' => 26,
    'type' => 2,
    'name' => '福州府',
    'x' => 473,
    'y' => -62,
    'icon' => 103,
  ),
  27 => 
  array (
    'id' => 27,
    'type' => 1,
    'name' => '积分点',
    'x' => 478,
    'y' => -5,
    'icon' => 0,
  ),
  28 => 
  array (
    'id' => 28,
    'type' => 1,
    'name' => '积分点',
    'x' => 489,
    'y' => 42,
    'icon' => 0,
  ),
  29 => 
  array (
    'id' => 29,
    'type' => 1,
    'name' => '积分点',
    'x' => 499,
    'y' => 101,
    'icon' => 0,
  ),
  30 => 
  array (
    'id' => 30,
    'type' => 1,
    'name' => '积分点',
    'x' => 453,
    'y' => 140,
    'icon' => 0,
  ),
  31 => 
  array (
    'id' => 31,
    'type' => 2,
    'name' => '江宁府',
    'x' => 393,
    'y' => 172,
    'icon' => 104,
  ),
  32 => 
  array (
    'id' => 32,
    'type' => 1,
    'name' => '积分点',
    'x' => 370,
    'y' => 218,
    'icon' => 0,
  ),
  33 => 
  array (
    'id' => 33,
    'type' => 1,
    'name' => '积分点',
    'x' => 400,
    'y' => 252,
    'icon' => 0,
  ),
  34 => 
  array (
    'id' => 34,
    'type' => 1,
    'name' => '积分点',
    'x' => 430,
    'y' => 282,
    'icon' => 0,
  ),
  35 => 
  array (
    'id' => 35,
    'type' => 1,
    'name' => '积分点',
    'x' => 441,
    'y' => 321,
    'icon' => 0,
  ),
  36 => 
  array (
    'id' => 36,
    'type' => 2,
    'name' => '盛京府',
    'x' => 402,
    'y' => 472,
    'icon' => 108,
  ),
  37 => 
  array (
    'id' => 37,
    'type' => 1,
    'name' => '积分点',
    'x' => 339,
    'y' => 474,
    'icon' => 0,
  ),
  38 => 
  array (
    'id' => 38,
    'type' => 1,
    'name' => '积分点',
    'x' => 295,
    'y' => 468,
    'icon' => 0,
  ),
  39 => 
  array (
    'id' => 39,
    'type' => 1,
    'name' => '积分点',
    'x' => 247,
    'y' => 460,
    'icon' => 0,
  ),
  40 => 
  array (
    'id' => 40,
    'type' => 1,
    'name' => '积分点',
    'x' => 196,
    'y' => 445,
    'icon' => 0,
  ),
  41 => 
  array (
    'id' => 41,
    'type' => 3,
    'name' => '顺天府',
    'x' => 136,
    'y' => 422,
    'icon' => 101,
  ),
);