<?php
//寻访-建筑
return array (
  1 => 
  array (
    'id' => 1,
    'name' => '长安',
    'lock' => 0,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  2 => 
  array (
    'id' => 2,
    'name' => '汉中',
    'lock' => 0,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  3 => 
  array (
    'id' => 3,
    'name' => '邯郸',
    'lock' => 0,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  4 => 
  array (
    'id' => 4,
    'name' => '楼兰',
    'lock' => 18,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  5 => 
  array (
    'id' => 5,
    'name' => '渭城',
    'lock' => 14,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  6 => 
  array (
    'id' => 6,
    'name' => '蓬莱',
    'lock' => 19,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  7 => 
  array (
    'id' => 7,
    'name' => '巴蜀',
    'lock' => 9,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  8 => 
  array (
    'id' => 8,
    'name' => '淮阳',
    'lock' => 8,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  9 => 
  array (
    'id' => 9,
    'name' => '庐陵',
    'lock' => 10,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  10 => 
  array (
    'id' => 10,
    'name' => '广陵',
    'lock' => 0,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  11 => 
  array (
    'id' => 11,
    'name' => '余杭',
    'lock' => 0,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  12 => 
  array (
    'id' => 12,
    'name' => '陇西',
    'lock' => 12,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  13 => 
  array (
    'id' => 13,
    'name' => '武陵',
    'lock' => 11,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  14 => 
  array (
    'id' => 14,
    'name' => '洛阳',
    'lock' => 7,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  16 => 
  array (
    'id' => 16,
    'name' => '雁门',
    'lock' => 0,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  17 => 
  array (
    'id' => 17,
    'name' => '会稽',
    'lock' => 5,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
  18 => 
  array (
    'id' => 18,
    'name' => '南阳',
    'lock' => 15,
    'chenzi' => '1|2|3|4|5|6',
    'wife' => '1|2|3|4|5|6',
  ),
);