<?php
/*
 * 后台配置
 */
return array(
	'len' => 2,
	'names' => array(
		0 => array(
            "安","白","柏","班","包","保","北堂","毕","边","薄","卜","蔡","苍","苍穹","岑","畅","车","辰","伯牙","赤","程","楚","丛","崔","戴","单","单于","澹台","党","邸","溯源","丁岐","窦","独孤","杜","段","樊","范","梵","耶律","房","费","圣","凤","伏","傅","高","郜","耿","公孙","公西","公冶","公玉","宫","龚","巩","苟","谷","顾","官","管","桂","韩","郝","狂","和","贺","赫连","侯","傲世","皇甫","黄","姬","冀","贾","江","姜","蒋","焦","金","晋","荆","井","景","柯","孔","匡","来","蓝","郎","雷","黎","栗","连","梁","廖","林","蔺","凌","令狐","川流","柳","龙","娄","楼兰","卢","陆","路","吕","罗","九宫","梅","蒙","孟","苗","莫","牟","慕","慕容","南宫","聂","炼","宁","欧","欧阳","潘","庞","裴","彭","戚","亓官","祁","齐","钱","秦","青阳","邱","曲","任","戎","荣","阮","芮","桑","沙","上官","邵","申","申屠","沈","施","石","时","史","舒","司","司马","司徒","苏","太叔","谈","覃","汤","唐","陶","滕","傲","佟","涂","屠","拓拔","万","沽光","韦","卫","尉迟","魏","文","翁","邬","吴","伍","武","西门","习","席","夏","夏侯","冼","向","项","萧","谢","辛","邢","艾夏","熊","胥","虚","九天","轩辕","薛","荀","巽","严","沿","阎","燕","阳","杨","遥","叶","伊","衣","尹"
		),
		1 => array(
            "宝佩","冰墨","冰俏","冰瑶","冰月","沧海","车艳","茈幻","茈静","德慧","德钰","灯冉","冬瑶","尔弥","尔钰","芳弥","芙宛","浮雪","光慧","海如","含月","涵玲","寒雅","寒娅","鸿镜","鸿玲","侯月","华月","桦绮","慧风","雨遥","加雪","槿贞","九曜","久遥","珂伊","寇玲","寇之","葵","兰巧","岚夕","岚雅","冷璇","离月","里蕊","丽萱","怜香","莲巧","莲瑜","林熙","淋铃","琳","琳钰","灵幻","灵枢","玲咏","铃香","泷","胧","缕可","绿雅","洛舒","洛熙","洛玉","落心","落雪","落雁","曼香","美海","梦灵","梦铃","梦弥","梦如","梦心","弥叶","宓姬","宓玉","妙海","妙妍","妙玉","摩离","末芮","墨涵","墨灵","墨霜","墨玉","沐雅","那沙","娜","南瑶","涅柔","凝佩","凝霜","凝香","傲雪","沛玲","沛淇","沛琪","沛琴","沛心","沛芝","佩青","佩雪","祈拉","绮罗","茜","巧柔","琴立","琴雅","琴语","琴真","青鸾","青落","青萱","青瑶","秋涵","秋沛","秋若","曲黎","容月","如蝉","如锦","如诗","如霜","茹絮","茹絮","软玉","蕊","芮冬","芮巧","瑞萱","若冰","若宁","桑燕","珊瑶","尚璇","诗文","诗雅","淑瑶","霜儿","霜遥","司璇","素问","逖雅","亭婉","婷曼","婷婉","薇仪","文蕊","文燕","沃雅","夕鸾","夕月","惜鸾","惜冉","夏尼","弦琴","翔若","晓莲","晓容","心婉","馨","秀锦","续莹","絮如","轩月","萱","璇","雪含","雪曼","雪未","雪幽","桠延","雅","雅沛","雅妍","雅奕","嫣","嫣然","延颖","妍","妍之","燕秋","遥杉","遥星","瑶青","瑶欣","瑶依","叶弥","叶妙","伊梵","伊涵","伊然","伊雯","伊汶","依落","依絮","怡","忆幻","亦珊","亦轩","奕兰","莹","莹珈","永巧","幽岚","幽胧","悠霓","渝心","瑜","瑜雅","羽柔","雨诗","雨燕","语嫣","语颖","玉莹","钰萱","鸢","元琴","月见","月灵","月玲","月绒","月蜇","云苏","芸","芸倩","韵寒","韵柳","珍筝","芝染","芷柔","芷蕊","芷真","智萱","卓敏","卓雅","卓云","子凤","子弥","子冉","子雯","子雪","梓琴","梓晴","梓娆","梓柔","紫瑶"
		),
	),
);